pblfrnndmnr/control-bomba-isl1208-pic16-xc8/trunk/Control_BOMBA_RTC_ISL1208_V6.X/main.c
                if (flanco || haycambio) {
                    sprintf(cadenaamostrar, "SET FECH");
                    sprintf(cadenaamostrar2, "%02d/%02d/%02d", fecha.day, fecha.month, fecha.yr);
                    //sprintf(cadenaamostrar2, cadena_esp);
                    //sprintf(cadenaamostrar2, days_of_week[dia_de_la_semana(&fecha.day, &fecha.month, &fecha.yr)]);
                    //sprintf(cadenaamostrar2, "             ");
                    //haycambio = 0;
                } else {
                    sprintf(cadenaamostrar, "SET FECH");
                    sprintf(cadenaamostrar2, "  /%02d/%02d", fecha.month, fecha.yr);
                    //sprintf(cadenaamostrar2, cadena_esp);
                }
                bandera_graba_fecha = 1;
                break;
            }
            case SUBMENU_CONFIGURAMES:
            {
                modificafecha = MES;

                if (flanco || haycambio) {
                    sprintf(cadenaamostrar, "SET FECH");
                    sprintf(cadenaamostrar2, "%02d/%02d/%02d", fecha.day, fecha.month, fecha.yr);
                    //  sprintf(cadenaamostrar2, cadena_esp);
                    // sprintf(cadenaamostrar2, days_of_week[dia_de_la_semana(&fecha.day, &fecha.month, &fecha.yr)]);
                    //haycambio = 0;
                } else {
                    sprintf(cadenaamostrar, "SET FECH");
                    sprintf(cadenaamostrar2, "%02d/  /%02d", fecha.day, fecha.yr);
                    // sprintf(cadenaamostrar2, cadena_esp);
                }
                bandera_graba_fecha = 1;
                break;
            }
            case SUBMENU_CONFIGURAANIO:
            {
                modificafecha = ANIO;

                if (flanco || haycambio) {
                    sprintf(cadenaamostrar, "SET FECH");
                    sprintf(cadenaamostrar2, "%02d/%02d/%02d", fecha.day, fecha.month, fecha.yr);
                    // sprintf(cadenaamostrar2, cadena_esp);
                    //sprintf(cadenaamostrar2, days_of_week[dia_de_la_semana(&fecha.day, &fecha.month, &fecha.yr)]);
                    //haycambio = 0;
                } else {
                    sprintf(cadenaamostrar, "SET FECH");
                    sprintf(cadenaamostrar2, "%02d/%02d/  ", fecha.day, fecha.month);
                    //sprintf(cadenaamostrar2, cadena_esp);
                }
                bandera_graba_fecha = 1;
                break;
            }
                /* case MENU_CONFIGURAENCENDIDO:
                 {

                     if (flanco) {
                         sprintf(cadenaamostrar, "SET ENC ");
                         sprintf(cadenaamostrar2, cadena_esp);
                     }

                     break;
                 }*/
            case SUBMENU_CONFIGURAHORAENCENDIDO:
            {
                modificafecha = HORA;
                horario = &horarioenc;
                if (flanco || haycambio) {
                    sprintf(cadenaamostrar, "SET ENC ");
                    sprintf(cadenaamostrar2, "%02d:%02d   ", horarioenc.hrs, horarioenc.min);
                    //sprintf(cadenaamostrar2, cadena_esp);
                    //haycambio = 0;
                } else {
                    sprintf(cadenaamostrar, "SET ENC ");
                    sprintf(cadenaamostrar2, "  :%02d   ", horarioenc.min);
                    //sprintf(cadenaamostrar2, cadena_esp);
                }
                bandera_graba_hora = 1;
                break;
            }
            case SUBMENU_CONFIGURAMINUTOSENCENDIDO:
            {
                modificafecha = MINUTOS;
                horario = &horarioenc;
                if (flanco || haycambio) {
                    sprintf(cadenaamostrar, "SET ENC ");
                    sprintf(cadenaamostrar2, "%02d:%02d   ", horarioenc.hrs, horarioenc.min);
                    //sprintf(cadenaamostrar2, cadena_esp);
                    //haycambio = 0;
                } else {
                    sprintf(cadenaamostrar, "SET ENC ");
                    sprintf(cadenaamostrar2, "%02d:     ", horarioenc.hrs);
                    //sprintf(cadenaamostrar2, cadena_esp);
                }
                bandera_graba_hora = 1;
                break;
            }
            case SUBMENU_CONFIGURAPERIODOENCENDIDO:
            {
                modificafecha = PERIODOENCENDIDO;

                if (flanco || haycambio) {
                    sprintf(cadenaamostrar, "ENC: %02d'", tiempoencendido);
                    sprintf(cadenaamostrar2, "c/%u dias", periodoencendido + 1);
                    //sprintf(cadenaamostrar2, cadena_esp);
                    //haycambio = 0;
                } else {
                    sprintf(cadenaamostrar, "ENC: %02d'", tiempoencendido);
                    sprintf(cadenaamostrar2, "c/  dias");
                    // sprintf(cadenaamostrar2, cadena_esp);
                }
                bandera_graba_periodoytiempoencendido = 1;
                break;
            }

            case SUBMENU_CONFIGURATIEMPOENCENDIDO:
            {
                modificafecha = TIEMPOENCENDIDO;

                if (flanco || haycambio) {
                    sprintf(cadenaamostrar, "ENC: %02d'", tiempoencendido);
                    sprintf(cadenaamostrar2, "c/%u dias", periodoencendido + 1);
                    //sprintf(cadenaamostrar2, cadena_esp);
                    //haycambio = 0;
                } else {
                    sprintf(cadenaamostrar, "ENC:   '");
                    sprintf(cadenaamostrar2, "c/%u dias", periodoencendido + 1);
                    //sprintf(cadenaamostrar2, cadena_esp);
                }
                bandera_graba_periodoytiempoencendido = 1;
                break;
            }
            case MENU_CONFIGURAFALLACORRIENTE:
            {
                modificafecha = SINO;
                banderasino = &usa_falla_de_corriente;
                if (flanco || haycambio) {
                    if (usa_falla_de_corriente) {
                        sprintf(cadenaamostrar, "FC:   SI");
                        sprintf(cadenaamostrar2, cadena_esp);
                    } else {
                        sprintf(cadenaamostrar, "FC:   NO");
                        sprintf(cadenaamostrar2, cadena_esp);
                    }
                } else {
                    sprintf(cadenaamostrar, "FC:     ");
                    sprintf(cadenaamostrar2, cadena_esp);
                }
                bandera_graba_usa_falla_de_corriente = 1;
                break;
            }
            case MENU_CONFIGURATIEMPOFALLACORRIENTE:
            {
                modificafecha = TIEMPOFALLA;

