pblfrnndmnr/control-bomba-isl1208-pic16-xc8/trunk/Control_BOMBA_RTC_ISL1208_V6.X/main.c
                if (flanco || haycambio) {
                    sprintf(cadenaamostrar, "TFC: %02d'", tiempofalla);
                    sprintf(cadenaamostrar2, cadena_esp);
                    //haycambio = 0;
                } else {
                    sprintf(cadenaamostrar, "TFC:   '");
                    sprintf(cadenaamostrar2, cadena_esp);
                }
                bandera_graba_tiempofalla = 1;
                break;
            }

            case MENU_MUESTRAMEDICIONES:
            {
                //convierto el valor decimal a float
                //para una entrada de 3.3V la lectura es 1023
                //para 0 V la lectura es 0
                //para una maxima lectura quiero que en el display se observe 50A
                //Deseo que tambien me muestre 1 decimal, separo la parte entera y la decimal
                //como la resolucion es 1024, cada bit corresponde a 50A/1024=0.048828125A
                //cada 20 muestras tengo aproximdamente 1A

                adcenteroI = (unsigned int) mediciondecorriente;
                adcdecimalI = (unsigned int) ((mediciondecorriente - (unsigned int) mediciondecorriente)*10);
                sprintf(cadenaamostrar, "%2u.%uA   ", (unsigned int) adcenteroI, (unsigned int) adcdecimalI);
                sprintf(cadenaamostrar2, "%3uV    ", (unsigned int) adcenteroV);
                break;
            }
            default:
                break;
        };
        //////////////////////////////////////////////////////////
        //Finaliza Procesa los menú
        // </editor-fold>

        // <editor-fold defaultstate="collapsed" desc="Muestra estado de la bomba">
        /////////////////////////////////////////////////////////
        if (menuactual == MENU_INICIAL) {
            switch (estadobomba) {
                case BOMBAAPAGADA:
                {
                    sprintf(cadenaamostrar2, "     off");
                    break;
                }
                case BOMBAENCENDIDA:
                {
                    sprintf(cadenaamostrar2, "      on");
                    break;
                }
                default:
                    break;
            }
            switch (manual_automatico) {
                case MANUAL:
                {
                    strncpy(cadenaamostrar2, "MAN:", 4);
                    break;
                }
                case AUTOMATICO:
                {
                    strncpy(cadenaamostrar2, "AUT:", 4);
                    break;
                }
                default:
                    break;
            }
        }
        // </editor-fold>

        // <editor-fold defaultstate="collapsed" desc="Verifica estados de falla">

        if (!usa_falla_de_corriente) {
            estadofallacorriente = CORRIENTENORMAL;
            //TODO Agregado el uso o no de falla de corriente (probar si funciona)
        }

        if ((estadonivel == NIVELNORMAL) && (estadofallacorriente == CORRIENTENORMAL) && (estadofallavoltaje == VOLTAJENORMAL)) {


        } else {
            activabomba = APAGABOMBA;
        }
        //////////////////////////////////////////////////////
        //Fin Verifica estados de falla
        // </editor-fold>

        // <editor-fold defaultstate="collapsed" desc="Inicio de procesamiento de medicion de voltaje, corriente">
        //Inicio de procesamiento de medicion de voltaje, corriente
        /////////////////////////////////////////////////////////////
        //convierto el valor decimal a float
        //para una entrada de 3.3V la lectura es 1023
        //para 0 V la lectura es 0
        //para una maxima lectura quiero que en el display se observe 50A
        //Deseo que tambien me muestre 1 decimal, separo la parte entera y la decimal
        //como la resolucion es 1024, cada bit corresponde a 50A/1024=0.048828125A
        //cada 20 muestras tengo aproximdamente 1A
        mediciondevoltaje = (float) medidaV_adc * 440 / 1024;
        adcenteroV = (unsigned int) mediciondevoltaje;
        //Se lee el voltaje de alimentación constantemente
        if (adcenteroV <= VOLTAJEMAXIMO && adcenteroV >= VOLTAJEMINIMO) {
            estadofallavoltaje = VOLTAJENORMAL;
        } else {
            estadofallavoltaje = FALLAVOLTAJE;
        }
        mediciondecorriente = (float) medidaI_adc * 50 / 1024;
        /////////////////////////////////////////////////////////////
        //Fin de procesamiento de medicion de voltaje, corriente
        // </editor-fold>

        // <editor-fold defaultstate="collapsed" desc="Activa o desactiva la Bomba">
        //Activa o desactiva la Bomba
        ///////////////////////////////////////////////////////
        switch (activabomba) {
            case ENCIENDEBOMBA:
            {
                salidabomba = 1;
                estadobomba = 1;
                // vBackLightLCD_On();
                break;
            }
            case APAGABOMBA:
            {
                salidabomba = 0;
                estadobomba = 0;
                // vBackLightLCD_Off();
                break;
            }
            default:
                break;
        }
        //////////////////////////////////////////////////////
        //Fin Activa o desactiva la Bomba
        // </editor-fold>

        // <editor-fold defaultstate="collapsed" desc="Procesa Alarma">
        //Inicio Procesa Alarma
        ///////////////////////////////////////////////////////
        switch (alarma_encendido) {
            case NOALARMA:
            {
                break;
            }
            case SIALARMA:
            {
                if (manual_automatico == AUTOMATICO) {
                    bandera_orden_Alarma_bomba = 1;
                    buzzer_on(3);
                } else {
                    bandera_orden_Alarma_bomba = 0;
                }
                alarma_encendido = NOALARMA;
                isl1208SR.Valor = ISL1208_Read_status();
                isl1208SR.ALM = 0; //reseteo la indicacion de alarma del RTC

                ISL1208_Set_status(&isl1208SR.Valor);
                //Leo el valor de la alarma
                isl1208_get_time_enc(&horarioenc.hrs, &horarioenc.min, &horarioenc.sec);
                isl1208_get_dow_enc(&fechaenc.dow);
                /*TODO (implementado no probado )aca debo sumarle a fecha.dow el valor de periodoencendido
                 * para que respete cada cuantos dias se enciende la bomba
                 por ejemplo si la alarma se activo el lunes (1) y periodoencendido+1=3+1 es cada cuatro dias 4
                 debo hacer 1+4=5, 5%7=5 se deberia encender el viernes (5)
                 otro ejemplo si se encendio el jueves (4) y es cada 4 dias, 4+4=8, entonces 8%7=1 (lunes)
                 periodoencendido va de 0 a 6
                 0 corresponde a dia por dia (se debe desactivar la alarma por dow)
                 1 corresponde a cada dos dias
                 2 cada 3 dias
                 ...
                 6 cada 7 dias
                 */
                fechaenc.dow = (fecha.dow + periodoencendido + 1) % 7;
                isl1208_set_dow_enc(&fechaenc.dow, periodoencendido);
                horarioapagado.Valor = horarioenc.Valor;
                if (horarioapagado.min + tiempoencendido >= 60) {
                    horarioapagado.min = horarioapagado.min + tiempoencendido - 60;
                    if (horarioapagado.hrs == 23) {
                        horarioapagado.hrs = 0;
                    } else {
                        horarioapagado.hrs++;
                    }
                } else {
                    horarioapagado.min = horarioapagado.min + tiempoencendido;
                }
                break;
            }
            default:
                break;
        }
        //////////////////////////////////////////////////////
        //Fin Procesa Alarma
        // </editor-fold>

        // <editor-fold defaultstate="collapsed" desc="Verifica secuencia de arranque">
        /*para que el motor arranque se debe cumplir que:
         * el voltaje sea normal,
         * si está en manual, se haya pulsado el boton on_off
         * si está en automatico se haya activado la alarma por interrupcion
         * el nivel no sea bajo,
         * la corriente sea normal, por lo menos despues de un tiempo despues del arranque
         */
        if (estadofallavoltaje == VOLTAJENORMAL) {
            if (manual_automatico == MANUAL) {
                if (bandera_orden_on_off_bomba) {
                    if (indica_secuencia_arranque == 0) {
                        if (tiempo_secuencia_arranque == 0) {
                            activabomba = ENCIENDEBOMBA; //Enciendo la bomba para empezar a medir la corriente
                            estadofallacorriente = CORRIENTENORMAL;
                            estadonivel = NIVELNORMAL;
                            tiempo_secuencia_arranque = TIEMPOSECUENCIAARRANQUE;
                        } else {
                            // Una vez que se activo la bomba debo ver el estado de la corriente  para ver si no se pasa de los valores normales
                            if (mediciondecorriente <= CORRIENTEMAXIMA) {
                                estadofallacorriente = CORRIENTENORMAL;
                            } else {
                                estadofallacorriente = FALLACORRIENTE;
                            }

