pblfrnndmnr/control-bomba-isl1208-pic16-xc8/trunk/Control_BOMBA_RTC_ISL1208_V6.X/main.c
                        }
                    } else {
                        //ya finalizo la secuencia de arranque, entonces veo si se estabilizó la corriente
                        if (mediciondecorriente <= CORRIENTENORMALMAXIMA) {
                            estadofallacorriente = CORRIENTENORMAL;
                            cuenta_tiempofalla = 0;
                        } else {
                            //aca verifica si la falla está presente mucho tiempo con tiempofalla
                            if (indica_tiempo_falla == 0) {
                                if (cuenta_tiempofalla == 0) {
                                    cuenta_tiempofalla = tiempofalla;
                                }
                            } else {
                                //Expiro el tiempo de falla con una falla de sobrecorriente, debo apagar la bomba
                                estadofallacorriente = FALLACORRIENTE;
                                indica_tiempo_falla = 0;
                                cuenta_tiempofalla = 0;
                                indica_secuencia_arranque = 0;
                                tiempo_secuencia_arranque = 0;
                                bandera_orden_on_off_bomba = 0; //cambia la bandera de orden de encendido de bomba
                            }


                        }
                        if (mediciondecorriente >= CORRIENTENORMALMINIMA) {
                            estadonivel = NIVELNORMAL;

                        } else {
                            indica_secuencia_arranque = 0;
                            tiempo_secuencia_arranque = 0;
                            bandera_orden_on_off_bomba = 0;
                            estadonivel = NIVELBAJO;
                        }
                    }
                } else {
                    indica_secuencia_arranque = 0;
                    tiempo_secuencia_arranque = 0;
                    activabomba = APAGABOMBA;
                }
            } else {
                if (bandera_orden_Alarma_bomba) {
                    if (indica_secuencia_arranque == 0) {
                        if (tiempo_secuencia_arranque == 0) {
                            activabomba = ENCIENDEBOMBA; //Enciendo la bomba para empezar a medir la corriente
                            estadofallacorriente = CORRIENTENORMAL;
                            estadonivel = NIVELNORMAL;
                            tiempo_secuencia_arranque = TIEMPOSECUENCIAARRANQUE;
                        } else {
                            //Una vez que se activo la bomba debo ver el estado de la corriente  para ver si no se pasa de los valores normales
                            if (mediciondecorriente <= CORRIENTEMAXIMA) {
                                estadofallacorriente = CORRIENTENORMAL;
                            } else {
                                estadofallacorriente = FALLACORRIENTE;
                            }

                        }
                    } else {
                        // ya finalizo la secuencia de arranque, entonces veo si se estabilizó la corriente
                        if (mediciondecorriente <= CORRIENTENORMALMAXIMA) {
                            estadofallacorriente = CORRIENTENORMAL;
                            cuenta_tiempofalla = 0;
                        } else {
                            //aca verifica si la falla está presente mucho tiempo con tiempofalla
                            if (indica_tiempo_falla == 0) {
                                if (cuenta_tiempofalla == 0) {
                                    cuenta_tiempofalla = tiempofalla;
                                }
                            } else {
                                //Expiro el tiempo de falla con una falla de sobrecorriente, debo apagar la bomba
                                estadofallacorriente = FALLACORRIENTE;
                                indica_tiempo_falla = 0;
                                cuenta_tiempofalla = 0;
                                indica_secuencia_arranque = 0;
                                tiempo_secuencia_arranque = 0;
                                bandera_orden_Alarma_bomba = 0; //cambia la bandera de orden de encendido de bomba
                            }


                        }
                        if (mediciondecorriente >= CORRIENTENORMALMINIMA) {
                            estadonivel = NIVELNORMAL;
                            //Acá debo apagar la bomba cuando pase el tiempo de encendido de la bomba
                            if (horarioapagado.hrs == horarioactual.hrs && horarioapagado.min == horarioactual.min) {
                                indica_secuencia_arranque = 0;
                                tiempo_secuencia_arranque = 0;
                                bandera_orden_Alarma_bomba = 0;
                                activabomba = APAGABOMBA;
                            }
                        } else {

                            indica_secuencia_arranque = 0;
                            tiempo_secuencia_arranque = 0;
                            bandera_orden_Alarma_bomba = 0;
                            estadonivel = NIVELBAJO;

                        }
                    }
                } else {
                    indica_secuencia_arranque = 0;
                    tiempo_secuencia_arranque = 0;
                    activabomba = APAGABOMBA;
                }
            }


        }



        // </editor-fold>

        // <editor-fold defaultstate="collapsed" desc="Actualiza Display">
        //Actualiza Display
        /////////////////////////////////////////////
        if (refrescadisplay) {
            vGotoxyLCD(1, 1);
            cadena = cadenaamostrar;
            while (*cadena != '\0')
                vLCD_Putc(*cadena++);
            vGotoxyLCD(1, 2);
            cadena = cadenaamostrar2;
            while (*cadena != '\0')
                vLCD_Putc(*cadena++);
            haycambio = 0;
            refrescadisplay = 0;
        }
        ////////////////////////////////////////////////
        //Fin Actualiza Display
        // </editor-fold>

